## Proyecto No. 1

**importacion de librerias**

In [120]:
import psycopg2
import pandas as pd
import numpy as np

**creacion de funciones utiles**

In [176]:
def crear_bd():
    #conexion a la bd por defecto
    conexion = psycopg2.connect("host=127.0.0.1 dbname=postgres user=postgres password=root")
    conexion.set_session(autocommit=True)
    cursor = conexion.cursor()

    #cursor.execute("DROP DATABASE supermarket")
    #cursor.execute("CREATE DATABASE supermarket")

    #cerrar conexion a la bd por defecto
    conexion.close()
    
    #conexion a la bd accounts
    conexion = psycopg2.connect("host=127.0.0.1 dbname=supermarket user=postgres password=root")
    cursor = conexion.cursor()
    
    return cursor, conexion

In [3]:
def borrar_tablas(cursor, conexion):
    for query in create_table_queries:
        cursor.execute(query)
        conexion.commit()

In [4]:
def crear_tablas(cursor, conexion):
    for query in create_table_queries:
        cursor.execute(query)
        conexion.commit()

In [88]:
def insertar_registros(df, query):
    for i, row in df.iterrows():
        #print(list(row))
        cursor.execute(query, list(row))
    conexion.commit()

### Datos con los que se van a trabajar

In [66]:
df_invoices = pd.read_csv("datos/invoices.csv")

In [67]:
df_invoices = df_invoices.drop(['Date of Meal', 'Participants'], axis=1)

In [68]:
df_invoices.columns = df_invoices.columns.str.lower().str.replace(' ', '_')

In [70]:
df_invoices.head()

,order_id,date,meal_id,company_id,meal_price,type_of_meal
0,839FKFW2LLX4LMBB,27-05-2016,INBUX904GIHI8YBD,LJKS5NK6788CYMUU,469,Breakfast
1,97OX39BGVMHODLJM,27-09-2018,J0MMOOPP709DIDIE,LJKS5NK6788CYMUU,22,Dinner
2,041ORQM5OIHTIU6L,24-08-2014,E4UJLQNCI16UX5CS,LJKS5NK6788CYMUU,314,Lunch
3,YT796QI18WNGZ7ZJ,12-04-2014,C9SDFHF7553BE247,LJKS5NK6788CYMUU,438,Dinner
4,6YLROQT27B6HRF4E,28-07-2015,48EQXS6IHYNZDDZ5,LJKS5NK6788CYMUU,690,Lunch

In [69]:
df_invoices.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50017 entries, 0 to 50016
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   order_id      50017 non-null  object
 1   date          50017 non-null  object
 2   meal_id       50017 non-null  object
 3   company_id    50017 non-null  object
 4   meal_price    50017 non-null  int64
 5   type_of_meal  50017 non-null  object
dtypes: int64(1), object(5)
memory usage: 2.3+ MB

In [57]:
df_order_leads = pd.read_csv("datos/OrderLeads.csv")

In [58]:
df_order_leads.columns = df_order_leads.columns.str.lower().str.replace(' ', '_')

In [59]:
df_order_leads.head()

,order_id,company_id,company_name,date,order_value,converted
0,80EYLOKP9E762WKG,LJKS5NK6788CYMUU,Chimera-Chasing Casbah,18-02-2017,4875,1
1,TLEXR1HZWTUTBHPB,LJKS5NK6788CYMUU,Chimera-Chasing Casbah,30-07-2015,8425,0
2,839FKFW2LLX4LMBB,LJKS5NK6788CYMUU,Chimera-Chasing Casbah,27-05-2016,4837,0
3,97OX39BGVMHODLJM,LJKS5NK6788CYMUU,Chimera-Chasing Casbah,27-09-2018,343,0
4,5T4LGH4XGBWOD49Z,LJKS5NK6788CYMUU,Chimera-Chasing Casbah,14-01-2016,983,0

In [60]:
df_order_leads.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 6 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   order_id      100000 non-null  object
 1   company_id    100000 non-null  object
 2   company_name  100000 non-null  object
 3   date          100000 non-null  object
 4   order_value   100000 non-null  int64
 5   converted     100000 non-null  int64
dtypes: int64(2), object(4)
memory usage: 4.6+ MB

In [159]:
df_sales_team = pd.read_csv("datos/SalesTeam.csv")

In [160]:
df_sales_team.columns = df_sales_team.columns.str.lower().str.replace(' ', '_')

In [161]:
df_sales_team = df_sales_team.drop('unnamed:_0', axis=1)

In [162]:
df_sales_team = df_sales_team[['sales_team_id','sales_rep_id','company_id','company_name']]

In [179]:
df_sales_team.head()

,sales_team_id,sales_rep_id,company_id,company_name
0,1001,97UNNAT790E0WM4N,LJKS5NK6788CYMUU,Chimera-Chasing Casbah
1,1002,97UNNAT790E0WM4N,36MFTZOYMTAJP1RK,Tangential Sheds
2,1003,97UNNAT790E0WM4N,H3JRC7XX7WJAD4ZO,Two-Mile Grab
3,1004,97UNNAT790E0WM4N,HB25MDZR0MGCQUGX,Three-Men-And-A-Helper Congo'S
4,1005,97UNNAT790E0WM4N,7RVA8TIVBLBXMNO4,Biophysical Battleground

In [164]:
df_sales_team.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4725 entries, 0 to 4724
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   sales_team_id  4725 non-null   int64
 1   sales_rep_id   4725 non-null   object
 2   company_id     4725 non-null   object
 3   company_name   4725 non-null   object
dtypes: int64(1), object(3)
memory usage: 147.8+ KB

In [180]:
df_sales_repre = pd.read_csv("datos/sales_representative.csv")

In [181]:
df_sales_repre = df_sales_repre[['sales_rep_id','sales_rep']]

In [182]:
df_sales_repre.head()

       sales_rep_id          sales_rep
0  97UNNAT790E0WM4N  Jessie Mcallister
1  RRD2R9XMAJDP7TUY        Lois Bowers
2  G9T8KNQF8XD2XHTS      Melvin Dupree
3  VZV7I6YA8IAX510X       Betty Factor
4  HQRE2LG21W2OHCY5     John Rodriguez

In [183]:
df_sales_repre.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sales_rep_id  500 non-null    object
 1   sales_rep     500 non-null    object
dtypes: object(2)
memory usage: 7.9+ KB

### conectarse a la bd y crear tablas

In [177]:
cursor, conexion = crear_bd()

In [71]:
tabla_invoices = ("""CREATE TABLE IF NOT EXISTS invoices (
order_id VARCHAR PRIMARY KEY, 
date date, 
meal_id VARCHAR, 
company_id VARCHAR,
meal_price int,
type_of_meal VARCHAR
)""")

In [72]:
cursor.execute(tabla_invoices)
conexion.commit()

In [80]:
tabla_order_leads = ("""CREATE TABLE IF NOT EXISTS order_leads (
order_id VARCHAR PRIMARY KEY, 
company_id VARCHAR, 
company_name VARCHAR, 
date date,
order_value int,
converted int)""")
cursor.execute(tabla_order_leads)
conexion.commit()

In [178]:
tabla_sales_team = ("""CREATE TABLE IF NOT EXISTS sales_team (
sales_team_id int PRIMARY KEY,
sales_rep_id VARCHAR,
company_id VARCHAR,
company_name VARCHAR)
""")
cursor.execute(tabla_sales_team)
conexion.commit()

In [184]:
tabla_sales_repre = ("""CREATE TABLE IF NOT EXISTS sales_repres (
sales_rep_id VARCHAR PRIMARY KEY,
sales_rep VARCHAR)
""")
cursor.execute(tabla_sales_repre)
conexion.commit()

### Insertar registros en tablas

In [73]:
insert_tabla_invoices = ("""INSERT INTO invoices (
order_id, 
date, 
meal_id, 
company_id,
meal_price,
type_of_meal
)
VALUES (%s, %s, %s, %s, %s, %s
)""")

In [75]:
insertar_registros(df_invoices, insert_tabla_invoices)

In [82]:
insert_order_leads = ("""INSERT INTO order_leads (
order_id, 
company_id, 
company_name, 
date,
order_value,
converted
)
VALUES (%s, %s, %s, %s, %s, %s
)""")

In [85]:
insertar_registros(df_order_leads, insert_order_leads)

In [185]:
insert_tabla_sales_team = ("""INSERT INTO sales_team (
sales_team_id,
sales_rep_id,
company_id,
company_name
)
VALUES (%s, %s, %s, %s)
""")

In [186]:
insertar_registros(df_sales_team, insert_tabla_sales_team)

In [187]:
insert_tabla_sales_repres = ("""INSERT INTO sales_repres (
sales_rep_id , 
sales_rep)
VALUES (%s, %s)
""")

In [188]:
insertar_registros(df_sales_repre, insert_tabla_sales_repres)